# 1) შექმენით რიცხვებით სავსე სია, ამ სიიდან იპოვეთ და დაპრინტეთ მეორე ყველაზე დიდი რიცხვი, გამოიყენეთ for ციკლი.
numbers = [5, 12, 7, 21, 3, 21, 9]

max1 = numbers[0]
max2 = numbers[0]

for i in numbers:
    if i > max1:
        max2 = max1
        max1 = i
    elif i > max2 and i != max1:
        max2 = i

print(max2)


# 2) მომხმარებელს შემოატანინეთ წინადადება და დაითვალეთ თუ ამ წინადადებაში რამდენი სიტყვის სიგრძე არის 4-ზე მეტი,
#  დაპრინტეთ ასეთი სიტყვების რაოდენობა, მაგალითად 4. გამოიყენეთ while ციკლი.


# 3) მომხმარებელს შემოატანინეთ სიტყვა და გაიგეთ ეს სიტყვა არის თუ არა პალინდრომი - ანუ ეს სიტყვა წინიდანაც და უკნიდანაც 
# თუ ზუსტად იგივენაირად იკითხება. თუ კი მაშინ დაპრინტეთ True, თუ არა დაპრინტეთ False, გამოიყენეთ for ციკლი, არ გამოიყენოთ slicing - [::-1].


# 4) შექმენით არეული რიცხვებით სავსე გრძელი სია და 2 ცარიელი სია, ერთ სიაში ჩააგდეთ ყველა ის რიცხვი 
# რომელიც არის ლუწი და დგას კენტ ინდექსზე, ხოლო მეორე სიაში ჩააგდეთ ყველა ის რიცხვი რომელიც არის
# ლუწი და დგას კენტ ინდექსზე, გამოიყენეთ for ციკლი.

nums = [1, 2, 3, 4, 5, 6]

even_odd_index = []
odd_even_index = []

for i in range(len(nums)):
    if nums[i] % 2 == 0 and i % 2 == 1:
        even_odd_index.append(nums[i])
    if nums[i] % 2 == 1 and i % 2 == 0:
        odd_even_index.append(nums[i])

print(even_odd_index)
print(odd_even_index)





# 5) შექმენით ყველანაირი მონაცემთა ტიპების ელემენტებით სავსე სია, ამოშალეთ ყველა დუპლიკატები - ყველაფერი რაც
#  მეორდება 2-ზე მეტჯერ, გამოიყენეთ remove() ფუნქცია და while ციკლი.

A1 = [1, "a", 2, 1, "a", True, 2, 3, False, True]

i = 0
while i < len(A1):
    count = A1.count(A1[i])

    if count > 1:
        A1.remove(A1[i])
    else:
        i += 1

print(A1)




# 6)  მომხმარებელს შემოატანინეთ წინადადება და დაპრინტეთ ამ წინადადებაში მყოფი ყველაზე გრძელი სიტყვა, გამოიყენეთ while ციკლი, 
# არ გამოიყენოთ max() ფუნქცია.


























