#1)შექმენით სია ---> [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] ამ სიის ბოლოში დაამატე სიტყვა --> "ianvari" და
#  დაპრინტე საბოლოო სია ნახე დაემატა თუ არა
A1 =  [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
A1.append("ianvari")
print(A1)

#2)შექმენი სია ---> [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] ამ სიაში მეორე 
# ინდექსზე დაამატე სიტყვა ---> "bati" და დაპრინტე საბოლოო სია ნახე დაემატა თუ არა
A1 = [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
A1.insert(2 , "bati")
print(A1)

#3)შექმენი სია ---->  [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] ამ 
# სიიდან ამოშალე მე 5 ინდექსზე მდგომი ელემენტი და დაპრინტე საბოლოო სია ნახე ამოიშალა თუ არა
A1 = [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
A1.pop(5)
print(A1)

#4)შექმენი სია --->  [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] ამ სიიდან ამოშალე True და ასევე 
# ამოშალე "kote" და დაპრინტე საბოლოო სია და ნახე ამოიშალა თუ არა

A1 =  [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
A1.remove("kote")
A1.remove(True)
print(A1)




















