
// 1)შექმენი ორი შემთხვევითი ძალა:

// let hero = ...
// let monster = ...
// გმირის ძალა უნდა იყოს 20-დან 40-მდე
// მონსტრის ძალა უნდა იყოს 15-დან 35-მდე

// შემდეგ:

// დაბეჭდე ორივეს ძალა.
// თუ გმირის ძალა მეტია → "გმირმა მოიგო!"
// თუ მონსტრის ძალა მეტია → "მონსტრმა მოიგო!"
// თუ ძალები ტოლია → "ბრძოლა ფრედ დასრულდა!"

// დამატებითი წესი:
// თუ გმირის ძალა ზუსტად 30 აღმოჩნდა, მას დაემატოს 10 ძალა.

// ამის შემდეგ თავიდან უნდა შეადარო საბოლოო ძალები.


let hero =  Math.floor(Math.random() * 20) + 21
let monster =   Math.floor(Math.random() * 15) + 36

hero = hero === 30 ? hero + 10 : hero


console.log(hero > monster? "გმირმა მოიგო!" : hero < monster ? "მონსტრმა მოიგო!" : "ბრძოლა ფრედ დასრულდა!" )














