# 1) შექმენით სია რომელშიც იქნება მხოლოდ int მონაცემთა ტიპის ელემენტები, ამ სიიდან ამოშალე ყოველი რიცხვი რომელიც არის ლუწი
#  ან დგას კენტ ინდექსზე სიაში, 
# გამოიყენეთ remove() ფუნქცია და for ციკლი.
A1 = [2,4,6,8,7,5,9]
for i in range(len(A1) -1,-1,-1):
    if i % 2 == 1 or A1[i] % 2 == 0:
        A1.remove(A1[i])
print(A1)

# 2) შექმენით სია რომელშიც იქნება მხოლოდ სტრინგ მონაცემთა ტიპის ელემენტები, ამ სიის ბოლოში ცალ-ცალკე მეორედ ჩაამატე ყველა 
# ის სიტყვა რაც უკვე არის ამ სიაში, გამოიყენეთ for ციკლი და სიის შესაბამისი ფუნქცია.
A1 = ["gio","magida","saxli","andria"]
for i in A1[:]:
    A1.append(i)
    print(A1)



# 3) შექმენით 2 სია, ერთში იყოს მხოლოდ სტრინგ ტიპის ელემენტები, ხოლო მეორე სავსე იყოს ინტიჯერი მონაცემთა ტიპის ელემენტებით,
#  რიცხვებით სავსე სიიდან, სტრინგებით სავსე სიაში ჩაამატე ის რიცხვები რომლებიც არიან 20-ზე მეტი და 50-ზე ნაკლები. გამოიყენეთ for ციკლი და 
# შესაფერისი სიის ფუნქცია.
A1 = ["gio","magida","saxli","andria"]
A2 = [1,34,2,5,78,32,41,12]
for i in A2:
    if i>20 and i<50 :
        A1.append(i)
        print(A1)



# 4) შექმენით სიტყვებით სავსე სია და ამ სიაში ყველა ისეთ სიტყვას რომელიც იწყება პატარა ასოთი, პირველი ასო გაუხადეთ დიდი. გამოიყენეთ 
# for ციკლი და სტრინგის შესაბამისი ფუნქცია.
A1 = ["gio","Magida","Saxli","andria"]
for i in range(len(A1)):
    if A1[i][0].lower():
        A1[i] = A1[i].capitalize()
        print(A1)

# 5) თქვენი სიტყვებით ახსენით რას აკეთებს გავლილი მასალიდან ყველა შესწავლილი სიის და სტრინგის ფუნქციები და for ციკლი































