#ჩვენ ვისწავლეტ ოთხი მონაცემტა ტიპი:string, integer, foati, boolean.
#stringi- არის  მონაცემტა ტიპი რომელსაც სჭირდება"ბრჭყალები"
print("gamarjoba")
print("909")
#integr- არის მონაცემტა ტიპი რომელიც იწერება მხოლოდ ციფრებით და მას არ ჭირდება ბრჭყალები
print(28)
print(4024)
print(194)
#floati- არის მონაცემტა ტიპი რომელიც იწერება მხოლოდ ათწილადის სახით და არც მას არ ჭირდება ბრჭყალი
print(1.70)
print(4692.483)
#boolean- არის მონაცემტა ტიპი რომელსაც აქვს ორი მნიშვნელობა True end Folse
#ცვლადი არის ცარიელი ყუთ რმელსაც შგვილია დავაწეროტ სახელი და შევინახოთ რაიმე.
name = "gio"
age = 14
height = 1.75