#1)კომენტარის სახით ჩამოწერე თითეული სიის ფუნქცია რაც ვისწავლეთ და მიუწერეთ გვერდით ახსნა
#  განმარტება თუ რა გადაეცემა თითეულს და რას აკეთებს ის

# append  სიის ბოლოში ამატებს ერთ ელემენტს.
# insert  ამატებს ელემენტს კონკრეტულ ინდექსზე.
# pop  შლის ელემენტს ინდექსის მიხედვით.
# remove()  -> შლის სიის კონკრეტულ მნიშვნელობას.




2#)შექმენი რიცხვების სია.
#append() ფუნქციით დაამატე მასში რიცხვი 10 ბოლოში.
#დაბეჭდე სია რომ ნახო ჩაემატა თუ არა

A1 = [1, 2, 3, 4, 5]
A1.append(10)
print(A1)


#3)შექმენი სახელების სია.
#append() ფუნქციით დაამატე შენი სახელი სიის ბოლოში
#დაბეჭდე სია.
A1 = ["goga", "saba", "luka"]
A1.append("giorgi")   
print(A1)



#4)შექმენი სია სადაც შეიყვან სახელებს,შენიდავალებაა მომხმარებელს შემოატანინო რაიმე სახელი და
#  შეინახო ცვლადში,შემდეგ ჩაამატე append()ის დახმარებით სიის ბოლოში მომხმარებლის შემოტანილი სიტყვა ~
#დაბეჭდე სია რომნახო ჩაემატა თუ არა


A1 = ["ana", "nia", "mari"]
A2 = input("შეიყვანე სახელი: ")
A1.append(A2)
print(A1)


#5)შექმენი სია სადაც შეიყვანთ 5 სახეკს
#.insert() დახმარებით სიაში ჩაამატე მესამე ინდექსზე შენი სახელი



A1 = ["ana", "nia", "mari", "lizi", "nino"]
A1.insert(3, "giorgi")
print(A1)


#6)მომხმარებელს შემოატანინე სახელი და რიცხვი(integer 0 იდან 6 ჩათვლით)
#შენი დავალებაა შექმნა სია მინიმუმ 6 ელემენტიანი
#insert() დახმარებით დაამატე სიაში მომხმარებლის მიერ შემოტანილი რიცხვი,მომხმარებლის მიერ შემოტანილ ინდექსზე
#მაგ:მომხმარებელმა სახელი შემოიტანა საბა და რიცხვი 4 , შენი დავალებაა რომ საბა დაამატო მეოთხე ინდექსზე(გამოიყენე ცვლადის სახელები იმიტომ რომ არ იცი მომხმარებელი რა მნშვნელობებს შემოიტანს
#დაბეჭდე სია რომ ნახო ჩაემატა თუ არა


A1 = ["goga", "dato", "saba", "ana", "nika", "luka"]

A2 = input("შეიყვანე სახელი: ")
A3 = int(input("შეიყვანე რიცხვი (0-დან 6-მდე): "))

A1.insert(A3, A2)
print(A1)



#7)შექმენი სია:

#fruits = ["apple", "banana"]

#insert() ფუნქციით ჩასვი "orange" 1 ინდექსზე.


A1 = ["apple", "banana"]
A1.insert(1, "orange")
print(A1)

#8)შექმენი სია:

#names = ["goga", "saba", "luka"]

#insert()-ით ჩასვი "irakli" ბოლოს წინა პოზიციაზე ანუ ლუკას წინ



A1 = ["goga", "saba", "luka"]
A1.insert(2, "irakli")   
print(A1)


#9)შექმენი სია:

#foods = ["bread", "milk", "cheese"]

#insert() ფუნქციით ჩასვი "water" სიის დასაწყისში.



A1 = ["bread", "milk", "cheese"]
A1.insert(0, "water")
print(A1)



#10)შექმენი სია:numbers = [5, 10, 15]

#pop() ფუნქციით წაშალე ბოლო ელემენტი და დაბეჭდე განახლებული სია.


A1 = [5, 10, 15]
A1.pop()
print(A1)


#11)შექმენი სია:

#fruits = ["apple", "banana", "orange"]


#pop -ით ამოშალე "banana" და დაბეჭდე დარჩენილი სია.

A1 = ["apple", "banana", "orange"]
A1.pop(1)   
print(A1)



#12)შექმენი სია:

#names = ["goga", "saba", "luka"]


#ამოშალე "saba" pop()-ით  — შემდეგ დაბეჭდე სია რომ ნახო ამოიშალა თუ არა


A1 = ["goga", "saba", "luka"]
A1.pop(1)
print(A1)



#13)შექმენი სია:

#colors = ["red", "green", "blue" , "yellow" , "black" , "purple"]


#pop()-ით წაშალე "red" და დაბეჭდე განახლებული სია.

#შემდეგ სიიდან ასევე ამოშალე yellow

#დაბეჭდე სია და ნახე შედეგი


A1 = ["red", "green", "blue", "yellow", "black", "purple"]

A1.pop(0)   
A1.pop(3)   

print(A1)



#14)მომხმარებელს შემოტანინე რიცხვი(0 იდან 4 მდე და შეინახე ცვლადში

#შექმენი სია tems = ["pen", "pencil", "book", "eraser"] 

#pop ის დახმარებით სიიდან ამოშალე მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი


A1 = ["pen", "pencil", "book", "eraser"]

A2 = int(input("შეიყვანე რიცხვი (0-დან 4-მდე): "))

A1.pop(A2)
print(A1)



#15)შექმენი სია:

#fruits = ["apple", "banana", "orange"]


#remove() ფუნქციით სიისდან წაშალე "banana".

#დაბეჭდე სია ნახე ამოიშალა თუ არა


A1 = ["apple", "banana", "orange"]
A1.remove("banana")
print(A1)


#16)შექმენი სია:

#nums = [3, 5, 3, 7]


#remove()-ით წაშალე 3 და დააკვირდი, მხოლოდ პირველი 3 იანი შაიშლება.

#დაბეჭდე სია რომ დარწმუნდე



A1 = [3, 5, 3, 7]
A1.remove(3)   
print(A1)


#17)შექმენი სია:

#colors = ["red", "blue", "green"]


#remove() ფუნქციით წაშალე "blue" და დაბეჭდე განახლებული სია.


A1 = ["red", "blue", "green"]
A1.remove("blue")
print(A1)



#18)შექმენი სია:

#names = ["goga", "saba", "luka"]


#მომხმარებელს შემოატანინე ამ სამიდან რომელიმე სახელი შეინახე ცვლადში და remove()-ით წაშალე მომხმარებლის შემოტანილი სახელი სიიდან.

#დაბეჭდე სია რომ გაიგო მართლა ამოიშალა თუ არა


A1 = ["goga", "saba", "luka"]
A2 = input("რომელი სახელი გინდა ამოშალო (goga/saba/luka): ")

A1.remove(A2)
print(A1)



#19)შექმენი სია:

#items = ["pen", "pencil", "book", "pencil"]


#remove()-ით წაშალე "pencil" და დაბეჭდე დარჩენილი სია.


A1 = ["pen", "pencil", "book", "pencil"]
A1.remove("pencil")  
print(A1)










