# 1) შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება თქენს პირველ
# სიაში მყოფი მხოლოდ ლუწი რიცხვები. გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი.
A1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
A2 = []

for i in A1:
    if i % 2 == 0:
        A2.append(i)

print(A2)
# 2) შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება მხოლოდ
# თქენს პირველ სიაში კენტ ინდექსზე მდგომი რიცხვები რომელბიც არიან აუცილებლად კენტი. გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი.
A1 = [3, 8, 5, 11, 14, 17, 21]
A2 = []

for i in A1:
    if i % 2 != 0 :
        A2.append(i)

print(A2)
#  3) შექმენით სახელებით სავსე სია და ამ სიიდან ამოშალეთ ყოველი ის სიტყვა რომელიც იწყება ასო გ-თი
# და მთავრდება ასო ი-თი, გამოიყენეთ for ციკლი, დაწერეთ ორივე ხერხით, pop() ფუნქციითაც და remove() ფუნქციითაც


A1 = ["გიორგი", "მარიამი", "გეგი", "ლიზი", "გუგა"]

for i in range(len(A1)-1, -1, -1):
    if A1[i][0] == "გ" and A1[i][-1] == "ი":
        A1.pop(i)

print(A1)













# 4) შექმენით სტრინგებით სავსე სია, და ამ სიიდის ყველა ის სიტყვა რომლის პირველი ასო არის Uppercase-ში და რომელიც
# ამავდროულად დგას კენტ ინდექსზე სიაში, გაუხადეთ ასეთ სიტყვებს ყველა ასო პატარა - lowercase, ხოლო ყველა ის სიტყვა რომლის პირველი
# ასო არის Uppercase-ში და თან ეს სიტყვა დგას ლუწ ინდექსზე სიაში, ამოშალეთ სიიდან. დაპრინტეთ შეცვლილი სია.







#  5) შექმენით სიტყვებით სავსე სია, ამ სიიდან ამოშალეთ ყველა სიტყვა რომელიც იწყება Uppercase დიდი ასო G-თი და რომლის 
# ბოლო 2 ასო არის ასევე Uppercase. ხოლო ყველა სიტყვა რომლის თითოეული ასო არის Lowercase-ში, აიყვანეთ Uppercase-ში 
# შესაბამისი სტრინგის ფუნქციის გამოყენებით. დაპრინტეთ მიღებული სია.














#  6) შექმენით 2 სია, პირველ სიაში იყოს int მონაცემთა ტიპის ელემენტები, ხოლო მეორე სია სავსე იყოს string მონაცემთა 
# ტიპის ელემენტებით. For ციკლის საშუალებით, პირველი სიიდან remove() ფუნქციით ამოშალეთ ყოველი ლუწი რიცხვი რომლებიც 
# დგანან კენტ ინდექსზე, ხოლო მეორე სიიდან pop() ფუნქციით ამოშალეთ ყოველი ის სიტყვა რომელიც იწყება დიდი ასოთი და დგას
# ლუწ ინდექსზე. ბოლოს შეაერთეთ ორივე შეცვლილი სიები ერთმანეთში, გახადეთ საერთო სია და დაპრინტეთ. (კარგად დააკვირდით 
# პირობას და არ იჩქაროთ. წარმატებები! ! !)



A1 = [1,2,3,4,5,6,7,8,9,10]

A2 = ["gio", "Magida", "saxli", "kari", "Moxi", "muzaradi","Xmali" "wyali", "Xeli"]

for i in range(len(A1) -1,-1,-1):
    if i % 2 == 1 and A1[i] % 2 == 0:
        A1.remove(A1[i])




for i in range(len(A2)-1, -1, -1):
    if "A" <= A2[i][0] <= "Z" and i % 2 == 0:
        A2.pop(i)



 
A1.extend(A2)

print(A1)










