// 1)for ის დახმარებით გამოიტანე რიცხვები 0 დან 20 მდე

// 2)for ის დახმარებით გამოიტანე რიცხვები 10 დან 20 მდე

// 3)for ის დახმარებით გამოიტანეთ რიცხვები 20 დან 50 მდე 3 ის გამოტოვებით

// 4)for ის დახმარებით გამოიტანე შენი სახელი და გვარი 10 ჯერ

// 5)for ის დახმარებით გამოიტანე სიტყვა (even , რიცხვი) თუ რიცხვი ლუწია და გამოიტანე სიტყვა
//  (odd , რიცხვი) თუ რიცხვი კენტია 1 დან 30 მდე , გამოიყენეთ if else


//1
for (let i = 0; i <= 20; i++) {
    console.log(i)
}



//2
for (let i = 10; i <= 20; i++) {
    console.log(i)
}

//3
for (let i = 20; i <= 50; i += 3) {
    console.log(i)
}
//4
for (let i = 0; i <= 10; i++) {
    console.log("giorgi")
}



//5
for (let i = 1; i <= 30; i++) {
    if (i % 2 === 0) {
        console.log("even", i);
    } else {
        console.log("odd", i);
    }
}







