# 1) შექმენით რიცხვებით სავსე სია და ახალ სიაში ჩააგდეთ ყველა რიცხვი გამრავლებული 2-ზე. დაპრინტეთ ახალი სია.
A1 = [1, 2, 3, 4, 5]
A2 = []

for i in A1:
    A2.append(i * 2)

print(A2)


# 2) შექმენით სახელებით სავსე სია, მომხმარებელს შემოატანინეთ რაიმე რიცხვი, და ამ რიცხვის ინდექსზე ჩაამატეთ სახელი "ნიკა" თქვენს სიაში.

A1 = ["გიო", "ლუკა", "ანა", "მარი"]
A2 = int(input("შეიყვანე რიცხვი: "))

A1.insert(A2, "ნიკა")
print(A1)

# 3) შექმენით string წინადადების ცვლადი, ამ წინადადებიდან დაპრინტეთ მხოლოდ ხმოვანი ასოები.
A1 = "მე მიყვარს პროგრამირება"
A2 = "აეიოუ"

for i in A1:
    if i in A2:
        print(i)



# 4) შექმენით სტრინგებით სავსე სია, წაშალეთ ის სტრინგ მონაცემთა ტიპის ელემენტები რომლებიც არიან
#  4-ზე მეტი სიგრძეში ან დგანან კენტ ინდექსზე. გამოიყენეთ remove() ფუნქცია.

A1 = ["apple", "cat", "banana", "dog", "kiwi", "pear"]

for i in A1[:]: 
    if len(i) > 4 or A1.index(i) % 2 != 0:
        A1.remove(i)

print(A1)





# 5) შექმენით რიცხვებით სავსე სია, გამოითვალეთ რიცხვების საშუალო არითმეტიკული - რიცხვების ჯამი გაყოფილი რიცხვების რაოდენობაზე.




A1 = [4, 8, 10, 6, 12]

A2= 0
for i in A1:
    A2 += i

A3 = len(A1)
A4 = A2 / A3

print(A4)


                            