# 1) შექმენით სახელებით სავსე სია და ასევე ცარიელი სია: Upper_name = [].  სახელების სიიდან ცარიელ სიაში ჩაამატეთ ყველა ის
#  სახელი რომელიც იწყება დიდი ასოთი, გამოიყენეთ for ციკლი და შესაფერისი სიის და სტრინგის ფუნქციები.
A1 = ["gio","Magida","Saxli","andria"]
A2 = []
for i in range(len(A1)):
    if A1[i][0].upper():
        A2.append(A1[i])
print(A2)
          
        



# 2) შექმენით 2 სია - სახელების და გვარების. for ციკლის და ფუნქციების გამოყენებით სახელების სიაში ყველა სახელის ყველა
#  ასო გახადეთ დიდი, ხოლო გვარების სიაში ყველა გვარის თითოეული ასო გახადეთ პატარა, სულ ბოლოს კი გააერთიანეთ სახელების
#  სია გვარის სიასთან და დაპრინტეთ მიღებული შედეგი.

A1 = ["gio", "data", "Nika", "luka"]
A2 = ["BERIDZE", "qvariAni", "MESKHIA", "loMadZe"]


for i in range(len(A1)):
    A1[i] = A1[i].upper()

for i in range(len(A2)):
    A2[i] = A2[i].lower()


A3 = A1 + A2

print(A3)


# 3) შექმენით სტრინგებით სავსე სია და ამ სიიდან ამოშალეთ ყველა ის სიტყვა რომელიც არის ან 6-ზე ნაკლები სიგრძეში.


A1 = ["კატა", "ძაღლი", "მზიანი", "შუქურა", "ბალონი"]


for i in A1:            
    if len(i) <= 6:
        A1.remove(i)        

print(A1)


# 4) შექმენით float მონაცემთა ტიპის ელემენტებით სავსე სია რომელშიც იქნება 10 float ელემენტი და ამ სიიდან
#  ახალ ცარიელ სიაში ჩაამატეთ ის რიცხვები რომლებიც არიან 10-ზე მეტი და 100-ზე ნაკლები.

A1 = [5.5, 12.3, 45.6, 101.2, 99.9, 8.8, 77.7, 150.0, 23.4, 60.6]  
A2 = [] 

for i in A1:
    if 10 < i < 100:     
        A2.append(i) 

print(A2)



# 5) შექმენით 2 სია, პირველი სია იყოს სავსე 5 ცალი ქალაქის სახელებით, და მეორე სიაში მოთავსებული იყოს 10 
# ქვეყნის სახელი. თქვენი დავალებაა რომ ქვეყნის სახელებში ჩაამატოთ ყველა ქალაქის სახელები ცალ-ცალკე მენულე 
# ინდექსიდან მეოთხე ინდექსის ჩათვლით. გამოიყენეთ for ციკლი და შესაბამისი ფუნქციები.

A1 = ["თბილისი", "ბათუმი", "ქუთაისი", "ფოთი", "გორი"]   
A2 = ["საქართველო", "საქართველო2", "საქართველო3", "საქართველო4", "საქართველო5", "საქართველო6", "საქართველო7", "საქართველო8", "საქართველო9", "საქართველო10"]

for i in A1:
    A2.insert(0, i)  

print(A2)

















