#  1) შექმენით სიტყვებით სავსე სია, თუ სიტყვის ყველა ასო არის პატარა, ანუ წერია lowercase-ში, ამ სიტყვის ყველა ასო გახადეთ დიდი.
# თუ სიტყვა შეიცავს თუნდაც ერთ uppercase ასოს, ეს სიტყვა ამოშალეთ სიიდან. ბოლოს დაპრინტეთ  
# მიღებული სია. (არ შექმნათ ახალი სია, იმუშავეთ პირველ სიტყვების სიაში) გამოიყენეთ while ციკლი.


words = ["hello", "WORLD", "python", "PyThOn", "code"]

i = 0
while i < len(words):
    if words[i].lower():
        words[i] = words[i].upper()
        i += 1
    else:
        words.pop(i)

print(words)


# 2) შექმენით სტრინგის ცვლადი და ცარიელი სია. სტრინგში მყოფი დიდი ასოები გახადეთ პატარა 
# და ამ სიაში ჩაამატეთ, ხოლო სტრინგში მყოფი პატარა ასოები გახადეთ დიდი და ასევე ჩააგდეთ 
# ამ სიაში. დაპრინტეთ საბოლოო სია, გამოიყენეთ while ციკლი.


text = "PyThOn"
result = []

i = 0
while i < len(text):
    if text[i].upper():
        result.append(text[i].lower())
    else:
        result.append(text[i].upper())
    i += 1

print(result)




# 3) შექმენით სახელებით სავსე სია, ასევე შექმენით ცარიელი სია, თუ სიტყვის ყველა ასო არის პატარა, 
# მაშინ ამ სიტყვის ყველა ასო გახადეთ დიდი და შესაბამისი სიის ფუნქციის გამოყენებით ჩასვით ეს სიტყვა 
# ცარიელი სიის დასაწყისში, ხოლო თუ სიტყვის ყველა ასო არის დიდი, მაშინ ამ სიტყვის ყველა ასო
#  გახადეთ პატარა და შესაბამისი სიის ფუნქციის გამოყენებით ჩასვით ეს სიტყვა ცარიელი სიის ბოლოში.
#  ბოლოს დაპრინტეთ მიღებული სია. გამოიყენეთ for ციკლი.

names = ["gio", "NIKA", "dato", "LUKA"]
result = []

for i in names:
    if i.lower():
        result.insert(0, i.upper())
    elif i.upper():
        result.append(i.lower())
 
print(result)


# 4) შექმენით ქალაქების სია, წაშალეთ pop() ან remove() ფუნქციით ყველა ის სიტყვა რომლის ყველა
#  ასო არის დიდი, ხოლო ყველა სხვა სიტყვას ყველა ასო გაუხადეთ დიდი. დაპრინტეთ საბოლოო შედეგი. გამოიყენეთ while ციკლი.




cities = ["TBILISI", "kutaisi", "BATUMI", "rustavi"]

i = 0
while i < len(cities):
    if cities[i].upper():
        cities.pop(i)
    else:
        cities[i] = cities[i].upper()
        i += 1

print(cities)




# 5) შექმენით გვარებით სავსე სია, თუ სიტყვის ყველა ასო არის პატარა, მაშინ ეს სიტყვა ამოშალეთ ამ სიიდან და
#  თავიდან ჩაამატეთ იგივე სიაში, ოღონდ ერთი ინდექსით მარჯვნივ, და ყველა ასო ჰქონდეს დიდი. ხოლო თუ
#  სიტყვის ყველა ასო არის დიდი, მაშინ ეს სიტყვა ამოშალეთ ამ სიიდან და თავიდან ჩაამატეთ იგივე სიაში, ოღონდ
#  ერთი ინდექსით მარცხნივ, და ყველა ასო ჰქონდეს პატარა. იმუშავეთ ერთ სიაში, გამოიყენეთ while ციკლი.
# 6) შექმენით სტრინგის ცვლადი და ცარიელი სია, თუ სტრინგის ასო არის პატარა, მაშინ ცარიელ სიაში 
# ჩაამატეთ "+" ნიშანი, ხოლო თუ სტრინგის ასო არის დიდი, მაშინ ცარიელ სიაში ჩაამატეთ "-" ნიშანი. 
# თუ მინუსების რაოდენობა სიაში არის ლუწი, მაშინ წაშალე ყველა "+" ნიშანი, ხოლო თუ მინუსების 
# რაოდენობა სიაში არის კენტი, წაშალე ყველა "-" ნიშანი. "+" და "-" -ების თავიდან სიაში ჩასაგდებად გამოიყენეთ 
# for ციკლი, ხოლო "+" ან "-" -ების წასაშლელად გამოიყენეთ while ციკლი.

text = "PyTHon"
symbols = []

for i in text:
    if i.lower():
        symbols.append("+")
    elif i.upper():
        symbols.append("-")

minus_count = symbols.count("-")

i = 0
while i < len(symbols):
    if minus_count % 2 == 0 and symbols[i] == "+":
        symbols.pop(i)
    elif minus_count % 2 == 1 and symbols[i] == "-":
        symbols.pop(i)
    else:
        i += 1

print(symbols)








# 7) შექმენით წინადადების სტრინგის ცვლადი და ცარიელი სია, ცარიელ სიაში ჩაამატეთ სიტყვები 
# ცალ-ცალკე, არა ასოები, არამედ მთლიანი სიტყვები. ამაზე იჭყლიტეთ ტვინი, წარმატებებს გისურვებთ.

sentence = "Python is very powerful language"
words = []

current_word = ""
i = 0

while i < len(sentence):
    if sentence[i] != " ":
        current_word += sentence[i]
    else:
        words.append(current_word)
        current_word = ""
    i += 1

words.append(current_word)

print(words)









# 8) შექმენით სტრინგის ცვლადი და შემოაბრუნეთ ეს სტრინგი. არ გამოიყენოთ slicing. და ყველა ასო გაუხადეთ დიდი. დაპრინტეთ საბოლოო სტრინგი.


text = "python"
result = ""

for i in text:
    result = i + result

print(result.upper())




# 9) იმუშავეთ განვლილ მასალაზე - გადახედეთ რესურსებს.




























