#1)კომენტარის სახით ჩამოწერეთ რომელი მონაცემთა ტიპები ვისწავლეთ და თთეულს გვერდით მიუწერეთ 1 მაგალითი
#stringi= "gio", intejeri= 12, floati = 12.23,  buliani= true


#2)ტერმინალში გამოიტანეთ 1 სტრინგი 1 ინტეჯერი 1 ფლოუთი 1 ბულეანი
print("gio")
print(12)
print(1.2)
print(True)
#3)შექმენი 4 ცვლადი snake_case ის გამოყენებით,1 ში შეინახე სტრინგი მეორეში ინტეჯერი მესამეში ბულეანი მეოთხეში ფლოუთი,დაპრინტე თითოეული ამთგანი(გამოიყენე ცვლადის სახელები)
A1_gio = input("sheinaxe stringi")






#4)შექმენი 2 ცვლადი სადაც შეინახავ ინტეჯერ ტიპის მონაცემებს,თქვენი დავალებაა რომ ამ ორ რიცხვზე მოახდინოთ ყველა მათემატიკური მოქმედება რაც ვისწავლეთ
A1 = int(input("shemoiyvane intejeri"))
A2 = int(input("shemoiyvane ricxvi"))

print(A1+A2)
print(A1/A2)
print(A1*A2)
print(A1**A2)
print(A1//A2)
print(A1%A2)
print(A1-A2)
#5)შექმენი ორი ცვლადი შეინახე ორივეში სტრინგებიდ და შეკრიბე ეს ორი სტრინგი,ასევე კომენტარის სახით დაწერე რა ეწოდება ამ მოქმედებას(სტრინგების შეერთებას)
A1 = input("sheinaxe stringi")
A2 = input("sheinaxe stringi")
print(A1+A2)
#konkatinacia

#6)კომენტარის სახით ახსენით თითოეული რას აკეთებს და მოიყვანე თითო მაგალით --> % , // , **



#7)მომხმარებელს შემოატანინე ორი რიცხვიდ ა მოახდინე აბსოლიტურად ყველა ამთემატიკური მოქმედება ამ ორ რიცხვზე --> // ** %


#Bouns
# ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:

#      15 / 3 = 5
#      20 / 4 = 5
#      

#      15 // 10 = 1
#      10 // 7 =1
#      

#      4 * 3 = 12
#      40 * 3 = 120
#      120 * 3 = 360

#      4 ** 3 = 16
#      10 ** 3 = 1000
#     

#      10 % 7 = 3
#      3 % 2 = 1


#8)კომენტარის სახით ახსენით თთოეული რას აკეთებს --> str() , int() , float(),მოიყვანე თითო მაგალითი სამივე მათგანზე


#9)შექმენი 4 ცვლადი სადაც შეინახავ განსხვავებული ტიპის მონაცემებს,შენი დავალებაა რომ დაბეჭდო მათი ტიპები,გამოიყენე ნასწავლი ფუნქცია რომელიც იგებდა ფრჩხილებში გადაცემული ელემენტის ტიპს
A1 = input("shemoiyvane stringi")
A2 = int(input("shemoiyvane intejeri"))
A3 = float(input("shemoiyvane floati"))
A4 = bool(input("shemoiyvane buliani"))
print(type(A2))

#10)მომხმარებელს შემოატანინე ორი რიცხვი,შენი დავალეაბაა ამ ორ რიცხვზე მოახდინოთ შედარების ოპერაციები(გამოიყენე ყველა შედარების ოპერატორი რაც ვისწავლეთ)

A1 = int(input("shemoitane ricxvi "))
A2 = int(input("shemoitane ricxvi "))

print(A1==A2)
print(A1<A2)
print(A1>A2)
print(A1<=A2)
print(A1>=A2)











#11)კომენტარის სახით ახსენით რომელი ლოგიკური ოპერატორები ვისწავლეთ და რომლის გამოყენების დროს რა ხდება,მოიყვანე თითო მაგალითი 

#chven viswavlet ori logikuri operatori da esenia and da or
#end-is semtxveveashi ufro pioriteturie false da or-is shemtxvevashi ufro prioritetulia true
#12)გვერდით მიუწერეთ პასუხები წერტილების მაგივრად
#                                
# True and True -- True      |   True or True -- True           
# True and False -- False     |   True or False -- True
# False and True -- False   |   False or True -- True
# False and False -- False   |   False or False -- False

#13)გვერდით მიუწერეთ საბოლოო პასუხი წერტილების მაგივრად
#  5 == 10 and 10 <= 10 -- False  |   True or "giorgi" == "giorgi" -- .True..           
# True and False -- False        |   10 < 2 or "lasha" == "beqa" -- ..False.
# 10 > 3 and 5 == 3 -- False     |   2 >= 3 or 40 < 2 -- ...False
# True and 200 <= 200 -- True.    |   4 == 3 or 50 > 300 -- ..False. 


#14)ტერმინალში გამოიტანეთ თქვენი რიცხვები 5 იდან 200 მდე for loop
for i in range(5,200):
    print(i)


#15)ტერმინალში გამოიტანეთ რიცვები 100 დან 150 მდე 5 ის სტეპის გამოტოვებით for loop

for i in range(100,150,5):
    print(i)


#16)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ for loop
for i in range(11):
    print("giorgi")


#17)ტერმინალში გამოიტანეთ თქვენი რიცხვები 10 იდან 50 მდე while loop
i = 10
while i < 50:
   print(i)
   i = i + 1

#18)ტერმინალში გამოიტანეთ რიცვები 50 დან 150 მდე 10 ის სტეპის გამოტოვებით while loop

i = 50
while i <150:
    print(i)
    i = i + 10
#19)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ while loop

i = 1
while i <10:
    print("gio")
    i = i + 1





#20) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი და for loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი ```
A1 = ["gio", "data", "saba", "nika", "dachi"]
for i in range(5):
    print(A1[i]) 




#21) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი დაwhile loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი 
A1 = ["gio", "data", "saba", "nika", "dachi"]
i = 0
while i < 5:
    print(A1[i])
    i = i + 1



#22)შექმენი სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"],შენი დავალებაა ამ სიიდან გამოიტანო  საბა და იამზე როგორც დადებით ასევე უარყოფითი ინდექსების გამოყენებით
A1 = ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"]
print(A1[2],A1[4] )
print(A1[-4], A1[-1])
#23)შექმენი ცვლადი სადაც შეინახავ სტრინგს --> 'ჰიდროელექტროსადგური" , შენი დავალებაა რომ გამოიტანო მესამე და მერვე ინდექსზე მდგომი ასოები ტერმინალში
A1 = "ჰიდროელექტროსადგური"
print(A1[3] , A1[8])



#24)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებ რიცხვს , შემდეგ --> თუ მომხმარებლის მიერ შემოტანილი რიცცხვი არის 0 ზე მეტი დაუპრინტე -->"more than 0" , თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 0 ზე ნაკლები დაუპრინტე --> "Less than 0",სხვა შემთხვევაშიდ აუპრინტე --> "Equal 0"
A1 = int(input("shemoitane ricxvi"))
if A1 > 0:
    print("more than 0")
elif A1 < 0 :
    print( "Less than 0")
else :
    print("Equal 0")



#25)შექმენი ცვლადი სადაც შეინახავ სტადამიანების სახელებს(6 ცალი) სიას-->შემდეგ შეამოწმეთ --> თუ ამ სიაში მესამე ინდექსზე მდგომი ელემენტი არის "lasha" -->დაუპრინტე --> "You choose lasha" , თუ სიაში მყოფი ბოლო ინდექსზე მდგომი ელემენტი არის "giorgi" მაშინ დაუპრინტე -->"you choose giorgi" , სხვა შემთხვევაში დაუპრინტე --> "you choose other name"

A1 = ["gio", "data", "saba", "nika", "dachi" , "lasha"]

if A1[3] == "lasha":
    print("You choose lasha")
elif A1[-1] == "giorgi":
    print("you choose giorgi")
else :
    print("you choose other name")

    
#26)
# შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#              break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი

A1 = "giorgi741"
A2 = input("paroli")
while True:
    if A1 == A2:
        print("ამოიცანი")
        break
    else :
        A2 = input("paroli")



#27)შექმენი ცვლადი და შეინახე სტრინგი --> "ჰიდროელექტროსადგური" , შენი დავალებაა რომ ტერმინალში გამოიტანო სადგური ,გამოიყენე slicing, ასევე კიდევ გამოიტანე ელექტროსადგური აქაც გამოიყენე სლაისინგი
A1 = "ჰიდროელექტროსადგური"
print(A1[-7:])
print(A1[4:])

#28)შექმენი ცვლადი და შეინახე სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანი" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"] , შენი დავალებაა რომ ტერმინალში გამოიტანო ყველა სახელი საბადან სანიმდე,ასევე გამოიტანე სახელები გოგადან ირმა მდე გამოიყენე Slicing

A1 =  ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანი" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"]
print(A1[2:6])
print(A1[0:4])
#29)შექმენი სია სადაც შეინახავთ ინტეჯერებს,შენი დავალებაა შეამოწმო,თუ სიაში მყოფი მენულე ინდეწსზე მდგომი ელემენტი მეტია სიაში მყოფ ბოლო ინდექსზე მდგომ ელემენტზე და(and) ასევე სიის პირველი ელემენტი მეტია 0 ზე დაუპრინტე --> good , თუ სიის პირველი ელემენტი მეტია სიის ბოლო ელემენტზე და(and) სიის ნოლო ელემენტი ნაკლებია 0 ზე დაუპრინტე --> bad , სხვა შემთხვევაში დაუპრინტე -->"get out"
A1 = [212 , 33, 63, 63, 72, 82]
if A1[0] > A1[-1] and A1[0]> 0:
    print("good")
elif A1[0] >A1[-1] and A1[-1] <0:
    print("bad")
else :
    print("get out")


#30)შმომხმარებელს შემოატანინე ათწილადი,შემდეგ შეადარე,თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე მეტი და 30 ზე ნაკლები მაინ დაუპრინტე -->You entered number between 10 and 30, თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე ნაკლები და 0 ზე მეტი მაშნ დაუპრინტე --> You choose number between 0 and 10 , თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 0 ზე ნაკლები მაშინ დაუპრინტე you choose negative number , სხვა შემთხვევაში დაუპრინტე -->you choose zero(0)
A1 = float(input("shemoitane atwialdi"))
if 30>A1>10:
    print("You entered number between 10 and 30")
elif A1<10 and A1>0:
    print("You choose number between 0 and 10 ")
elif A1<0:
    print("you choose negative number ")
else :
    print("ou choose zero(0)")

#31)შექმენი სია სადაც შეინახავ სტრინგებს(ადამიანის სახელებს,რაც გინდათ და რამდენიც გინდათ),შემდეგ შეადარეთ თუ ამ სიაში მყოფი მე0 ინდექსზე მდგომი ელემენტი არის 'luka' ან(or) არის "saba" დაუპრინტე -->You choose luka or saba, თუ ამ სიაში მყოფი ბოლო ინდექსზე მყოფი ელემენტი არის "irma" ან(or) "iamze" მაშინ დაუპრინტე -->You choose luka or saba,სხვა შემთხვევაში დაუპტინტე --> You choose other name


A1 = ["gio", "magida", "skami", "saxli"]
if A1[0] == "luka" or A1[0] == "saba":
    print("You choose luka or saba")
elif  A1[-1] == "irma" or A1[-1] == "iamze":
    print("You choose luka or saba")
else:
    print("You choose other name")














